""" 슬라이드 """

a='sinagong'
print(a[3:7]) # a[3]부터 a[6]까지 출력 = a[3] a[4] a[5] a[6]
# agon

b=list(range(10)) # b=[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
print(b[:7:2]) # b[6]까지 2개 마다 출력 = b[0] b[2] b[4] b[6]
# [0, 2, 4, 6]

c='hello, world' 
print(c[7:]) # c[7]부터 끝까지 출력 = c[7] c[8] c[9] c[10] c[11]
# world

d=list(range(5, 22, 2)) # d=[5, 7, 9, 11, 13, 15, 17, 19, 21]
print(d[::3]) # 전체에서 3개마다 출력 = d[0] d[3] d[6]
# [5, 11, 17]

e=list(range(8)) # e=[0, 1, 2, 3, 4, 5, 6, 7]
print(e[2::2]) # e[2]부터 2개마다 출력 = e[2] e[4] e[6]
# [2, 4, 6]

f=list(range(8, 3, -1)) # f=[8, 7, 6, 5, 4]
print(f[:3]) # f[2]까지 출력 = f[0] f[1] f[2]
# [8, 7, 6]