#include <stdio.h>
int main() {
    /* 조건 연산자 */
    /* 조건 ? 수식1 : 수식2; 조건이 참이면 수식1, 거짓이면 수식2 */
    int a,b,c,d;

    a=1; b=2; c=3; d=4;
    b *= a>b ? a : b; // b = b*(a>b ? a : b) = 2*(1>2 ? 1 : 2) = 2*(거짓 ? 1 :2) = 2*(2) = 4
    printf("%d ", b); 

    a=1; b=2; c=3; d=4;
    c -= a<b ? a-b : b-a; // c = c-(a<b ? a-b : b-a) = 3-(1<2 ? -1 : 1) = 3-(-1) = 4
    printf("%d ", c); 

    a=1; b=2; c=3; d=4;
    d %= c<d ? c++ : d++; // d = d%(3<4 ? 3 : 4) = 4%3 = 1
    printf("%d ", d);  // c=4

    a=1; b=2; c=3; d=4;
    c += b<b ? ++a : b++; // c = c+(거짓 ? 2 : 2) = 3+2 = 5
    printf("%d ", c);

    a=1; b=2; c=3; d=4;
    d /= d%3 ? a*b : d%c; // d = 4/(4%3 ? 2 : 1) = 4/(참(1) ? 2 : 1) = 4/2 = 2
    printf("%d ", d);

    a=1; b=2; c=3; d=4;
    a += ++a % b++ ? c*d : b/c; // a=a+((2%2) ? 12 : (3/3)) = 2+(거짓(0) ? 12 : 1) = 2+1 = 2
    /* 조건에서 계산을 먼저 하고 참거짓 수식으로 이동하기 때문에 조건에서 일어난 후치연산이 적용됨 (거짓 식의 b가 3인 이유)*/
    printf("%d ", c);


}