#include <stdio.h>
int main() {
    /* 산술 연산자 */
    printf("%d ", 3 - 7 % 8 + 5); // 3-7+5=1
    printf("%d \n", -4 * 3 % -5 / 2); // (-12)%(-5)/2=(-2)/2=-1
   
    int a=2; int b=3; int c=4; int d=5;
    printf("%d ", ++a + ++a); // 4+4=8. a=4
    printf("%d ", a); // 위에서 ++a한거 유지. a=4
    printf("%d ", ++b - --c); // 4-3=1. b=4 c=3
    
    c=4;
    printf("%d ", ++c + c++ + ++c + c++); // 25

    c=4;
    a = ++c + c++ + ++c + c++;
    printf("%d ", a); // 25


    printf("%d ", c); // c=8
    printf("%d \n", 10 - --d); // 10-4=6. d=4


    /* 비트 연산자 */
    a=5; b=7;
    printf("%d ", a & b); // 101 & 111 = 101 => 5 (둘 다 1이면 1)
    printf("%d ", a | b); // 101 | 111 = 111 => 7 (둘 중 하나라도 1이면 1)
    printf("%d ", a ^ b); // 101 ^ 111 = 010 => 2 (둘이 같으면 0)
    printf("%d ", ~b); // ~111 = ...1111111111000 => -8
    printf("%d ", a >> 1); // 101 >> 1 = 10 => 2
    printf("%d \n", b << 3); // 111 << 3 = 111000 => 8+16+32=56


    /* 논리 연산자 */
    a=2; b=3; c=0; d=1; int e=1;
    printf("%d ", a>3 && b>2); // 2>3 && 3>2 = 0 && 1 = 0 (모두 참(1)이면 참(1))
    printf("%d ", a>3 || b>2); // 0 || 1 = 1 (하나라도 참이면 참)
    printf("%d ", !c); // !0 = 1
    printf("%d ", a==2 && b!=3); // 2 && 0 = 0
    printf("%d ", a & b && c); // (2&3) && 0 = 2진수(10&11) && 0 = 2진수(10) && 0 = 2 && 0 = 0
    printf("%d \n", ++d && --e); // 2 && 0 = 0
}